Examples/ClassDiagram/Exports/kotlin.mmd
classDiagram
    class Kotlin_medialibrary_Library["Library"] {
        +playlists MutableList~Playlist~
        +init(playlists MutableList~Playlist~)
        +addPlaylist(playlist Playlist)
        +playlist(named String) Playlist?
    }
    class Kotlin_medialibrary_MediaItem["MediaItem"] {
        +title String
        +duration Double
        +genre Genre
        +init(title String, duration Double, genre Genre)
        +play()
    }
    class Kotlin_medialibrary_Playable["Playable"] {
        <<interface>>
        +title String
        +duration Double
        +play()
    }
    class Kotlin_medialibrary_Genre["Genre"] {
        <<enumeration>>
        POP
        ROCK
        JAZZ
        CLASSICAL
        ELECTRONIC
        SPOKEN_WORD
    }
    class Kotlin_medialibrary_Player["Player"] {
        -library Library
        +nowPlaying Playable?
        +init(library Library)
        +play(item Playable)
        +playFirstItem(playlistNamed String)
    }
    class Kotlin_medialibrary_Playlist["Playlist"] {
        +name String
        +items MutableList~MediaItem~
        +totalDuration Double
        +init(name String, items MutableList~MediaItem~)
        +add(item MediaItem)
    }
    class Kotlin_medialibrary_Podcast["Podcast"] {
        +host String
        +episodeNumber Int
        +init(title String, duration Double, host String, episodeNumber Int)
        +play()
    }
    class Kotlin_medialibrary_Song["Song"] {
        +artist String
        +album String?
        +init(title String, duration Double, genre Genre, artist String, album String?)
        +play()
    }
    Kotlin_medialibrary_Playable <|.. Kotlin_medialibrary_MediaItem
    Kotlin_medialibrary_MediaItem <|-- Kotlin_medialibrary_Podcast
    Kotlin_medialibrary_MediaItem <|-- Kotlin_medialibrary_Song
    Kotlin_medialibrary_Library o-- "*" Kotlin_medialibrary_Playlist : playlists
    Kotlin_medialibrary_MediaItem *-- "1" Kotlin_medialibrary_Genre : genre
    Kotlin_medialibrary_Player *-- "1" Kotlin_medialibrary_Library : library
    Kotlin_medialibrary_Player *-- "0..1" Kotlin_medialibrary_Playable : nowPlaying
    Kotlin_medialibrary_Playlist o-- "*" Kotlin_medialibrary_MediaItem : items
    Kotlin_medialibrary_Song ..> Kotlin_medialibrary_Genre
